content/posts/applications_of_stochastic_processes.md
+++
title = "applications of stochastic processes"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:32-04:00
slug = "applications_of_stochastic_processes"
draft = false
+++

## [statistical physics]({{< relref "statistical_physics" >}}), [stochastic processes]({{< relref "stochastic_processes" >}}) {#statistical-physics--statistical-physics-dot-md--stochastic-processes--stochastic-processes-dot-md}


## [[Bayesian [probabilistic inference]({{< relref "probabilistic_inference" >}}) for [stochastic processes]({{< relref "stochastic_processes" >}}) {#bayesian-probabilistic-inference--probabilistic-inference-dot-md--for-stochastic-processes--stochastic-processes-dot-md}


## [simulation]({{< relref "simulation" >}}) {#simulation--simulation-dot-md}


### [BioSimulator.jl](<https://alanderos91.github.io/BioSimulator.jl/stable/>) in [julia]({{< relref "julia" >}}) {#biosimulator-dot-jl--https-alanderos91-dot-github-dot-io-biosimulator-dot-jl-stable--in-julia--julia-dot-md}


## chemical reaction networks [chemical reaction network theory]({{< relref "chemical_reaction_network_theory" >}}) {#chemical-reaction-networks-chemical-reaction-network-theory--chemical-reaction-network-theory-dot-md}


### [Large deviations and dynamical phase transitions in stochastic chemical networks by Lazarescu and Esposito in 2019]({{< relref "Large_deviations_and_dynamical_phase_transitions_in_stochastic_chemical_networks_by_Lazarescu_and_Esposito_in_2019" >}}) {#large-deviations-and-dynamical-phase-transitions-in-stochastic-chemical-networks-by-lazarescu-and-esposito-in-2019--large-deviations-and-dynamical-phase-transitions-in-stochastic-chemical-networks-by-lazarescu-and-esposito-in-2019-dot-md}


### Galstyan, V., & Saakian, D. B. (2012). Dynamics of the chemical master equation, a strip of chains of equations in d-dimensional space. <span class="underline"><span class="underline">Physical Review E</span></span>, \_\_86\_\_(1), 011125. <https://doi.org/10.1103/PhysRevE.86.011125> {#galstyan-v-dot-and-saakian-d-dot-b-dot--2012--dot-dynamics-of-the-chemical-master-equation-a-strip-of-chains-of-equations-in-d-dimensional-space-dot-86--1--011125-dot-https-doi-dot-org-10-dot-1103-physreve-dot-86-dot-011125}


### [Approximation and inference methods for stochastic biochemical kinetics—a tutorial review by David Schnoerr, Guido Sanguinetti and Ramon Grima in 2017]({{< relref "Approximation_and_inference_methods_for_stochastic_biochemical_kinetics—a_tutorial_review_by_David_Schnoerr,_Guido_Sanguinetti_and_Ramon_Grima_in_2017" >}}) {#approximation-and-inference-methods-for-stochastic-biochemical-kinetics-a-tutorial-review-by-david-schnoerr-guido-sanguinetti-and-ramon-grima-in-2017--approximation-and-inference-methods-for-stochastic-biochemical-kinetics-a-tutorial-review-by-david-schnoerr-guido-sanguinetti-and-ramon-grima-in-2017-dot-md}


### [Inferring gene regulatory networks from single-cell data a mechanistic approach by Ulysse Herbach, Olivier Gandrillon, et al in 2017]({{< relref "Inferring_gene_regulatory_networks_from_single-cell_data_a_mechanistic_approach_by_Ulysse_Herbach,_Olivier_Gandrillon,_et_al_in_2017" >}}) {#inferring-gene-regulatory-networks-from-single-cell-data-a-mechanistic-approach-by-ulysse-herbach-olivier-gandrillon-et-al-in-2017--inferring-gene-regulatory-networks-from-single-cell-data-a-mechanistic-approach-by-ulysse-herbach-olivier-gandrillon-et-al-in-2017-dot-md}


## [population dynamics]({{< relref "population_dynamics" >}}) {#population-dynamics--population-dynamics-dot-md}


### Saakian, D. B., Yakushkina, T., & Koonin, E. V. (2019). Allele fixation probability in a Moran model with fluctuating fitness landscapes. <span class="underline"><span class="underline">Physical Review E</span></span>, \_\_99\_\_(2), 022407. <https://doi.org/10.1103/PhysRevE.99.022407> {#saakian-d-dot-b-dot-yakushkina-t-dot-and-koonin-e-dot-v-dot--2019--dot-allele-fixation-probability-in-a-moran-model-with-fluctuating-fitness-landscapes-dot-99--2--022407-dot-https-doi-dot-org-10-dot-1103-physreve-dot-99-dot-022407}


### Sella, G., & Hirsh, A. E. (2005). The application of statistical physics to evolutionary biology. <span class="underline"><span class="underline">PNAS</span></span>, \_\_102\_\_(27), 9541–9546. <https://doi.org/10.1073/pnas.0501865102> {#sella-g-dot-and-hirsh-a-dot-e-dot--2005--dot-the-application-of-statistical-physics-to-evolutionary-biology-dot-102--27--9541-9546-dot-https-doi-dot-org-10-dot-1073-pnas-dot-0501865102}


### [Introductory Lectures on Stochastic Population Systems by Donald Dawson in 2017]({{< relref "Introductory_Lectures_on_Stochastic_Population_Systems_by_Donald_Dawson_in_2017" >}}) {#introductory-lectures-on-stochastic-population-systems-by-donald-dawson-in-2017--introductory-lectures-on-stochastic-population-systems-by-donald-dawson-in-2017-dot-md}


### [Population biology and criticality by Nico Stollenwerk and Vincent Johnson in 2010]({{< relref "Population_biology_and_criticality_by_Nico_Stollenwerk_and_Vincent_Johnson_in_2010" >}}) {#population-biology-and-criticality-by-nico-stollenwerk-and-vincent-johnson-in-2010--population-biology-and-criticality-by-nico-stollenwerk-and-vincent-johnson-in-2010-dot-md}


## [marginal observations]({{< relref "marginal_observations" >}}) of biochemical systems [biochemistry]({{< relref "biochemistry" >}}) {#marginal-observations--marginal-observations-dot-md--of-biochemical-systems-biochemistry--biochemistry-dot-md}


### Altaner, B., & Vollmer, J. (2012). Fluctuation-Preserving Coarse Graining for Biochemical Systems. <span class="underline"><span class="underline">Physical Review Letters</span></span>, \_\_108\_\_(22), 228101. <https://doi.org/10.1103/PhysRevLett.108.228101> {#altaner-b-dot-and-vollmer-j-dot--2012--dot-fluctuation-preserving-coarse-graining-for-biochemical-systems-dot-108--22--228101-dot-https-doi-dot-org-10-dot-1103-physrevlett-dot-108-dot-228101}


### Bravi, B., & Sollich, P. (2017). Statistical physics approaches to subnetwork dynamics in biochemical systems. <span class="underline"><span class="underline">Physical Biology</span></span>, \_\_14\_\_(4), 045010. <https://doi.org/10.1088/1478-3975/aa7363> [Statistical physics approaches to subnetwork dynamics in biochemical systems by Bravi and Sollich in 2017]({{< relref "Statistical_physics_approaches_to_subnetwork_dynamics_in_biochemical_systems_by_Bravi_and_Sollich_in_2017" >}}) {#bravi-b-dot-and-sollich-p-dot--2017--dot-statistical-physics-approaches-to-subnetwork-dynamics-in-biochemical-systems-dot-14--4--045010-dot-https-doi-dot-org-10-dot-1088-1478-3975-aa7363-statistical-physics-approaches-to-subnetwork-dynamics-in-biochemical-systems-by-bravi-and-sollich-in-2017--statistical-physics-approaches-to-subnetwork-dynamics-in-biochemical-systems-by-bravi-and-sollich-in-2017-dot-md}


## Computation and [probabilistic inference]({{< relref "probabilistic_inference" >}}) {#computation-and-probabilistic-inference--probabilistic-inference-dot-md}


### Mezard, M., & Montanari, A. (2009). \_\_Information, physics, and computation\_\_. Oxford University Press. [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}}) {#mezard-m-dot-and-montanari-a-dot--2009--dot-information-physics-and-computation-dot-oxford-university-press-dot-information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009--information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009-dot-md}


### [A high-bias, low-variance introduction to Machine Learning for physicists by Pankaj Mehta, Charles Fisher, David Schwab, et al in 2018]({{< relref "A_high-bias,_low-variance_introduction_to_Machine_Learning_for_physicists_by_Pankaj_Mehta,_Charles_Fisher,_David_Schwab,_et_al_in_2018" >}}) {#a-high-bias-low-variance-introduction-to-machine-learning-for-physicists-by-pankaj-mehta-charles-fisher-david-schwab-et-al-in-2018--a-high-bias-low-variance-introduction-to-machine-learning-for-physicists-by-pankaj-mehta-charles-fisher-david-schwab-et-al-in-2018-dot-md}
